analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32520/Include/max32520.svd
    <register>
     <name>CRC_CTRL</name>
     <description>CRC Control Register.</description>
     <addressOffset>0x0C</addressOffset>
     <fields>
      <field>
       <name>CRC</name>
       <description>Cyclic Redundancy Check Enable. The CRC cannot be enabled if the PRNG is enabled.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enable.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>MSB</name>
       <description>MSB select. This bit selects the order of calculating CRC on data.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>lsbFirst</name>
         <description>LSB First.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>msbFirst</name>
         <description>MSB First.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field derivedFrom="CRC">
       <name>PRNG</name>
       <description>Pseudo Random Number Generator Enable. If entropy is disabled, this outputs one byte of pseudo random data per clock cycle. If entropy is enabled, data is output at a rate of one bit per clock cycle.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="CRC">
       <name>ENT</name>
       <description>Entropy Enable. If the PRNG is enabled, this mixes the high frequency ring oscillator with the LFSR. If the PRNG is disabled, the raw entropy data is output at a rate of 1 bit per clock. This makes it possible to characterize the quality of the entropy source.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="CRC">
       <name>HAM</name>
       <description>Hamming Code Enable. Enable hamming code calculation.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>HRST</name>
       <description>Hamming Reset. Reset Hamming code ECC generator for next block.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <access>write-only</access>
       <enumeratedValues>
        <usage>write</usage>
        <enumeratedValue>
         <name>reset</name>
         <description>Starts reset operation.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>DMA_SRC</name>
     <description>Crypto DMA Source Address.</description>
     <addressOffset>0x10</addressOffset>
     <fields>
      <field>
       <name>ADDR</name>
       <description>DMA Source Address.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>DMA_DEST</name>
     <description>Crypto DMA Destination Address.</description>
     <addressOffset>0x14</addressOffset>
     <fields>
      <field>
       <name>ADDR</name>
       <description>DMA Destination Address.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>DMA_CNT</name>
     <description>Crypto DMA Byte Count.</description>
     <addressOffset>0x18</addressOffset>
     <fields>
      <field>
       <name>CNT</name>
       <description>DMA Byte Address.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <dim>4</dim>
     <dimIncrement>4</dimIncrement>
     <name>CRYPTO_DIN[%s]</name>
     <description>Crypto Data Input. Data input can be written to this register instead of using the DMA. This register writes to the FIFO. This register occupies four successive words to allow the use of multi-store instructions. Words can be written to any location, they will be placed in the FIFO in the order they are written. The endian swap input control bit affects this register.</description>
     <addressOffset>0x20</addressOffset>
     <access>write-only</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>Crypto Data Input. Input can be written to this register instead of using DMA.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <dim>4</dim>
     <dimIncrement>4</dimIncrement>
     <name>CRYPTO_DOUT[%s]</name>
     <description>Crypto Data Output. Resulting data from cipher calculation. Data is placed in the lower words of these four registers depending on the algorithm. For block cipher modes, this register holds the result of most recent encryption or decryption operation. These registers are affected by the endian swap bits.</description>
     <addressOffset>0x30</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>Crypto Data Output. Resulting data from cipher calculation. Data is placed in the lower words of these four registers depending on algorithm.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>CRC_POLY</name>
     <description>CRC Polynomial. The polynomial to be used for Galois Field calculations (CRC or LFSR) should be written to this register. This register is affected by the MSB control bit.</description>
     <addressOffset>0x40</addressOffset>
     <resetValue>0xEDB88320</resetValue>
     <fields>
      <field>
       <name>POLY</name>
       <description>CRC Polynomial. The polynomial to be used for Galois Field calculations (CRC or LFSR) should be written to this register. This register is affected by the MSB control bit.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>CRC_VAL</name>
     <description>CRC Value. This is the state for the Galois Field. This register holds the result of a CRC calculation or the current state of the LFSR. This register is affected by the MSB control bit.</description>
     <addressOffset>0x44</addressOffset>
     <resetValue>0xFFFFFFFF</resetValue>
     <fields>
      <field>
       <name>VAL</name>
       <description>CRC Value. This is the state for the Galois Field. This register holds the result of a CRC calculation or the current state of LFSR. This register is affected by the MSB control bit.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>CRC_PRNG</name>
     <description>Pseudo-Random Number Generator. Output of the Galois Field shift register. This holds the resulting pseudo-random number if entropy is disabled or true random number if entropy is enabled.</description>
     <addressOffset>0x48</addressOffset>
     <resetValue>0</resetValue>
     <fields>
      <field>
       <name>PRNG</name>
       <description>Pseudo-Random Number Generator. Output of the Galois Field shift register. This holds the resulting pseudo-random number if entropy is disabled or true random number if entropy is enabled.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>HAM_ECC</name>
     <description>Hamming ECC Register.</description>
     <addressOffset>0x4C</addressOffset>
     <fields>
      <field>
       <name>ECC</name>
       <description>Hamming ECC Value. These bits are the even parity of their corresponding bit groups.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
      </field>
      <field>
       <name>PAR</name>
       <description>Parity. This is the parity of the entire array.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>even</name>
         <description>Even.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>odd</name>
         <description>Odd.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <dim>4</dim>
     <dimIncrement>4</dimIncrement>
     <name>CIPHER_INIT[%s]</name>
     <description>Initial Vector. For block cipher operations that use CBC, CFB, OFB, or CNTR modes, this register holds the initial value. This register is updated with each encryption or decryption operation. This register is affected by the endian swap bits.</description>
     <addressOffset>0x50</addressOffset>
     <fields>
      <field>
       <name>IVEC</name>
       <description>Initial Vector. For block cipher operations that use CBC, CFB, OFB, or CNTR modes, this register holds the initial value. This register is updated with each encryption or decryption operation. This register is affected by the endian swap bits.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <dim>8</dim>
     <dimIncrement>4</dimIncrement>
     <name>CIPHER_KEY[%s]</name>
     <description>Cipher Key.  This register holds the key used for block cipher operations. The lower words are used for block ciphers that use shorter key lengths. This register is affected by the endian swap input control bits.</description>
     <addressOffset>0x60</addressOffset>
     <access>write-only</access>
     <fields>
      <field>
       <name>KEY</name>
       <description>Cipher Key. This register holds the key used for block cipher operations. The lower words are used for block ciphers that use shorter kye lengths. This register is affected by the endian swap input control bits.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <dim>16</dim>
     <dimIncrement>4</dimIncrement>
     <name>HASH_DIGEST[%s]</name>
     <description>This register holds the calculated hash value. This register is affected by the endian swap bits.</description>
     <addressOffset>0x80</addressOffset>
     <fields>
      <field>
       <name>HASH</name>
       <description>This register holds the calculated hash value. This register is affected by the endian swap bits.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <dim>4</dim>
     <dimIncrement>4</dimIncrement>
     <name>HASH_MSG_SZ[%s]</name>
     <description>Message Size. This register holds the lowest 32-bit of message size in bytes.</description>
     <addressOffset>0xC0</addressOffset>
     <fields>
      <field>
       <name>MSGSZ</name>
       <description>Message Size. This register holds the lowest 32-bit of message size in bytes.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>A_LENGTH_0</name>
     <description>.AAD Length Register 0.</description>
     <addressOffset>0xD0</addressOffset>
     <resetValue>0x0</resetValue>
     <fields>
      <field>
       <name>A_LENGTH</name>
       <description>AAD length in bytes for AES GCM and CCM operations.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>A_LENGTH_1</name>
     <description>.AAD Length Register 1.</description>
     <addressOffset>0xD4</addressOffset>
     <resetValue>0x0</resetValue>
     <fields>
      <field>
       <name>A_LENGTH</name>
       <description>AAD length in bytes for AES GCM and CCM operations.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>PLD_LENGTH_0</name>
     <description>.PLD Length Register 0.</description>
     <addressOffset>0xD8</addressOffset>
     <resetValue>0x0</resetValue>
     <fields>
      <field>
       <name>PLD_LENGTH</name>
       <description>PLD length in bytes for AES GCM and CCM operations.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>PLD_LENGTH_1</name>
     <description>.LENGTH.</description>
     <addressOffset>0xDC</addressOffset>
     <resetValue>0x0</resetValue>
     <fields>
      <field>
       <name>PLD_LENGTH</name>
       <description>PLD length in bytes for AES GCM and CCM operations.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <dim>4</dim>
     <dimIncrement>4</dimIncrement>
     <name>TAGMIC[%s]</name>
     <description>TAG/MIC Registers.</description>
     <addressOffset>0xE0</addressOffset>
     <fields>
      <field>
       <name>TAGMIC</name>
       <description>TAG/MIC output for AES GCM and CCM operations.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>SCA_CN</name>
     <description>SCA Control 0 Register.</description>
     <addressOffset>0x100</addressOffset>
     <fields>
      <field>
       <name>STC</name>
       <description>Start Calculation.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SCAIE</name>
       <description>SCA Interrupt Enable.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>disable</name>
         <description>Disable</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>enable</name>
         <description>Enable</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ABORT</name>
       <description>Abort Operation.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ERMEM</name>
       <description>Erase Cryptographic Memory.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>MANPARAM</name>
       <description>ECC Parameter Source.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>HWKEY</name>
       <description>Hardware Key Select.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>OPCODE</name>
       <description>SCA Opcode.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>5</bitWidth>
      </field>
      <field>
       <name>MODADDR</name>
       <description>MODULO Address Offset.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>5</bitWidth>
      </field>
      <field>
       <name>ECCSIZE</name>
       <description>ECC Size.</description>
       <bitOffset>24</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>SCA_ACN</name>
     <description>SCA Advanced Control Register.</description>
     <addressOffset>0x104</addressOffset>
     <fields>
      <field>
       <name>MAN</name>
       <description>SCA Mode.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>auto</name>
         <description>Auto Mode</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>manual</name>
         <description>Manual Mode</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>AUTOCARRY</name>
       <description>Automatically propagate the carry for the next operation.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>PLUSONE</name>
       <description>Enable Carry propagation for the next operation.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RESSELECT</name>
       <description>ALU Selection.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field>
       <name>CARRYPOS</name>
       <description>To set Carry location.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>10</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>SCA_ST</name>
     <description>SCA Status Register.</description>
     <addressOffset>0x108</addressOffset>
     <fields>
      <field>
       <name>BUSY</name>
       <description>SCA Busy.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SCAIF</name>
       <description>SCA Interrupt Flag.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>PVF1</name>
       <description>Point 1 Verification Failed.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>PVF2</name>
       <description>Point 2 Verification Failed.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>FSMERR</name>
       <description>FSM Transition Error.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>COMPERR</name>
       <description>EC Computation Error.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>MEMERR</name>
       <description>SCA Memory Access Error.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CARRY</name>
       <description>Carry on ongoing operation.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>GTE2I2</name>
       <description>Modulo 2x Result.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ALUNEG1</name>
       <description>ALU 2 SubSign of the subtraction result for ALU_2.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ALUNEG2</name>
       <description>ALU 2 SubSign of the subtraction result for ALU_2.</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>SCA_PPX_ADDR</name>
     <description>PPX Coordinate Data Pointer Register.</description>
     <addressOffset>0x10C</addressOffset>
     <resetValue>0x0</resetValue>
     <fields>
      <field>
       <name>PPX_ADDR</name>
       <description>Point P Coordinate Data Pointer.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>SCA_PPY_ADDR</name>
     <description>PPY Coordinate Data Pointer Register.</description>
     <addressOffset>0x110</addressOffset>
     <resetValue>0x0</resetValue>
     <fields>
      <field>
       <name>PPY_ADDR</name>
       <description>Point P Coordinate Data Pointer.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>SCA_PPZ_ADDR</name>
     <description>PPZ Coordinate Data Pointer Register.</description>
     <addressOffset>0x114</addressOffset>
     <resetValue>0x0</resetValue>
     <fields>
      <field>
       <name>PPZ_ADDR</name>
       <description>Point P Coordinate Data Pointer.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>SCA_PQX_ADDR</name>
     <description>PQX Coordinate Data Pointer Register.</description>
     <addressOffset>0x118</addressOffset>
     <resetValue>0x0</resetValue>
     <fields>
      <field>
       <name>PQX_ADDR</name>
       <description>Point Q Coordinate Data Pointer.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>SCA_PQY_ADDR</name>
     <description>PQY Coordinate Data Pointer Register.</description>
     <addressOffset>0x11C</addressOffset>
     <resetValue>0x0</resetValue>
     <fields>
      <field>
       <name>PQY_ADDR</name>
       <description>Point Q Coordinate Data Pointer.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>SCA_PQZ_ADDR</name>
     <description>PQZ Coordinate Data Pointer Register.</description>
     <addressOffset>0x120</addressOffset>
     <resetValue>0x0</resetValue>
     <fields>
      <field>
       <name>PQZ_ADDR</name>
       <description>Point Q Coordinate Data Pointer.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>SCA_RDSA_ADDR</name>
     <description>SCA RDSA Address Register.</description>
     <addressOffset>0x124</addressOffset>
     <resetValue>0x0</resetValue>
     <fields>
      <field>
       <name>RDSA_ADDR</name>
       <description>The starting address of the R portion for R, S ECDSA signature.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>SCA_RES_ADDR</name>
     <description>SCA Result Address Register.</description>
     <addressOffset>0x128</addressOffset>
     <resetValue>0x0</resetValue>
     <fields>
      <field>
       <name>RES_ADDR</name>
       <description>Starting address of result storage.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>SCA_OP_BUFF_ADDR</name>
     <description>SCA Operation Buffer Address Register.</description>
     <addressOffset>0x12C</addressOffset>
     <resetValue>0x0</resetValue>
     <fields>
      <field>
       <name>OPBUFF_ADDR</name>
       <description>Starting address of operation buffer.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>SCA_MODDATA</name>
     <description>SCA Modulo Data Input Register.</description>
     <addressOffset>0x130</addressOffset>
     <resetValue>0x0</resetValue>
     <fields>
      <field>
       <name>MODDATA</name>
       <description>Used to load the SCA modulo for modular operations.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
