analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32520/Include/max32520.svd
   </registers>
  </peripheral>
<!--GPIO0 Individual I/O for each GPIO-->
  <peripheral derivedFrom="GPIO0">
   <name>GPIO1</name>
   <description>Individual I/O for each GPIO 1</description>
   <baseAddress>0x40009000</baseAddress>
   <interrupt>
    <name>GPIO1</name>
    <description>GPIO1 IRQ</description>
    <value>25</value>
   </interrupt>
  </peripheral>
<!--GPIO1 Individual I/O for each GPIO 1-->
  <peripheral>
   <name>I2C0</name>
   <description>Inter-Integrated Circuit.</description>
   <groupName>I2C</groupName>
   <baseAddress>0x4001D000</baseAddress>
   <size>32</size>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x1000</size>
    <usage>registers</usage>
   </addressBlock>
   <interrupt>
    <name>I2C0</name>
    <description>I2C0 IRQ</description>
    <value>13</value>
   </interrupt>
   <registers>
    <register>
     <name>CN</name>
     <description>Control Register0.</description>
     <addressOffset>0x00</addressOffset>
     <fields>
      <field>
       <name>I2CEN</name>
       <description>I2C Enable.</description>
       <bitRange>[0:0]</bitRange>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable I2C.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enable I2C.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>MST</name>
       <description>Master Mode Enable.</description>
       <bitRange>[1:1]</bitRange>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>slave_mode</name>
         <description>Slave Mode.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>master_mode</name>
         <description>Master Mode.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>GCEN</name>
       <description>General Call Address Enable.</description>
       <bitRange>[2:2]</bitRange>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Ignore Gneral Call Address.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Acknowledge general call address.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>IRXM</name>
       <description>Interactive Receive Mode.</description>
       <bitRange>[3:3]</bitRange>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable Interactive Receive Mode.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enable Interactive Receive Mode.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ACK</name>
       <description>Data Acknowledge. This bit defines the acknowledge bit returned by the I2C receiver while IRXM = 1 HW forces ACK to 0 when IRXM = 0.</description>
       <bitRange>[4:4]</bitRange>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>ack</name>
         <description>return ACK (pulling SDA LOW).</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>nack</name>
         <description>return NACK (leaving SDA HIGH).</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SCLO</name>
       <description>SCL Output. This bits control SCL output when SWOE =1.</description>
       <bitRange>[6:6]</bitRange>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>drive_scl_low</name>
         <description>Drive SCL low. </description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>release_scl</name>
         <description>Release SCL.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SDAO</name>
       <description>SDA Output. This bits control SDA output when SWOE = 1. </description>
       <bitRange>[7:7]</bitRange>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>drive_sda_low</name>
         <description>Drive SDA low. </description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>release_sda</name>
         <description>Release SDA.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SCL</name>
       <description>SCL status. This bit reflects the logic gate of SCL signal. </description>
       <bitRange>[8:8]</bitRange>
       <access>read-only</access>
      </field>
      <field>
       <name>SDA</name>
       <description>SDA status. This bit reflects the logic gate of SDA signal.</description>
       <bitRange>[9:9]</bitRange>
       <access>read-only</access>
      </field>
      <field>
       <name>SWOE</name>
       <description>Software Output Enable.</description>
       <bitRange>[10:10]</bitRange>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>outputs_disable</name>
         <description>I2C Outputs SCLO and SDAO disabled. </description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>outputs_enable</name>
         <description>I2C Outputs SCLO and SDAO enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>READ</name>
       <description>Read. This bit reflects the R/W bit of an address match (AMI = 1) or general call match (GCI = 1). This bit is valid 3 cycles after the relevant interrupt bit is set.</description>
       <bitRange>[11:11]</bitRange>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>write</name>
         <description>Write.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>read</name>
         <description>Read.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SCLSTRD</name>
       <description>This bit will disable slave clock stretching when set.</description>
       <bitRange>[12:12]</bitRange>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>en</name>
         <description>Slave clock stretching enabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>dis</name>
         <description>Slave clock stretching disabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SCLPPM</name>
       <description>SCL Push-Pull Mode. This bit controls whether SCL is operated in a the I2C standard open-drain mode, or in a non-standard push-pull mode where the Hi-Z output isreplaced with Drive-1. The non-standard mode should only be used when operating as a master and communicating with slaves that are guaranteed to never drive SCL low. </description>
       <bitRange>[13:13]</bitRange>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Standard open-drain operation:
					drive low for 0, Hi-Z for 1</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Non-standard push-pull operation:
					drive low for 0, drive high for 1</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>ST</name>
     <description>Status Register.</description>
     <addressOffset>0x04</addressOffset>
     <fields>
      <field>
       <name>BUS</name>
       <description>Bus Status.</description>
       <bitRange>[0:0]</bitRange>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>idle</name>
         <description>I2C Bus Idle.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>busy</name>
         <description>I2C Bus Busy.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RXE</name>
       <description>RX empty.</description>
       <bitRange>[1:1]</bitRange>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>not_empty</name>
         <description>Not Empty.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>empty</name>
         <description>Empty.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RXF</name>
       <description>RX Full.</description>
       <bitRange>[2:2]</bitRange>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>not_full</name>
         <description>Not Full.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>full</name>
         <description>Full.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TXE</name>
       <description>TX Empty.</description>
       <bitRange>[3:3]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>not_empty</name>
         <description>Not Empty.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>empty</name>
         <description>Empty.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TXF</name>
       <description>TX Full.</description>
       <bitRange>[4:4]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>not_empty</name>
         <description>Not Empty.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>empty</name>
         <description>Empty.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>CKMD</name>
       <description>Clock Mode.</description>
       <bitRange>[5:5]</bitRange>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>not_actively_driving_scl_clock</name>
         <description>Device not actively driving SCL clock cycles.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>actively_driving_scl_clock</name>
         <description>Device operating as master and actively driving SCL clock cycles.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ST</name>
       <description>Status Controller.</description>
       <bitRange>[11:8]</bitRange>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>INT0</name>
     <description>Interrupt Status Register.</description>
     <addressOffset>0x08</addressOffset>
     <fields>
      <field>
       <name>DONEI</name>
       <description>Transfer Done Interrupt.</description>
       <bitRange>[0:0]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>inactive</name>
         <description>No Interrupt is Pending.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>pending</name>
         <description>An interrupt is pending.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>IRXMI</name>
       <description>Interactive Receive Interrupt.</description>
       <bitRange>[1:1]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>inactive</name>
         <description>No Interrupt is Pending.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>pending</name>
         <description>An interrupt is pending.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>GCI</name>
       <description>Slave General Call Address Match Interrupt.</description>
       <bitRange>[2:2]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>inactive</name>
         <description>No Interrupt is Pending.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>pending</name>
         <description>An interrupt is pending.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>AMI</name>
       <description>Slave Address Match Interrupt.</description>
       <bitRange>[3:3]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>inactive</name>
         <description>No Interrupt is Pending.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>pending</name>
         <description>An interrupt is pending.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RXTHI</name>
       <description>Receive Threshold Interrupt. This bit is automaticcaly cleared when RX_FIFO is below the threshold level.</description>
       <bitRange>[4:4]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>inactive</name>
         <description>No interrupt is pending.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>pending</name>
         <description>An interrupt is pending. RX_FIFO equal or more bytes than the threshold.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TXTHI</name>
       <description>Transmit Threshold Interrupt. This bit is automaticcaly cleared when TX_FIFO is above the threshold level.</description>
       <bitRange>[5:5]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>inactive</name>
         <description>No interrupt is pending.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>pending</name>
         <description>An interrupt is pending. TX_FIFO has equal or less bytes than the threshold.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>STOPI</name>
       <description>STOP Interrupt.</description>
       <bitRange>[6:6]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>inactive</name>
         <description>No interrupt is pending.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>pending</name>
         <description>An interrupt is pending. TX_FIFO has equal or less bytes than the threshold.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ADRACKI</name>
       <description>Address Acknowledge Interrupt.</description>
       <bitRange>[7:7]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>inactive</name>
         <description>No Interrupt is Pending.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>pending</name>
         <description>An interrupt is pending.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ARBERI</name>
       <description>Arbritation error Interrupt.</description>
       <bitRange>[8:8]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>inactive</name>
         <description>No Interrupt is Pending.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>pending</name>
         <description>An interrupt is pending.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TOERI</name>
       <description>timeout Error Interrupt.</description>
       <bitRange>[9:9]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>inactive</name>
         <description>No Interrupt is Pending.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>pending</name>
         <description>An interrupt is pending.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ADRERI</name>
       <description>Address NACK Error Interrupt.</description>
       <bitRange>[10:10]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>inactive</name>
         <description>No Interrupt is Pending.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>pending</name>
         <description>An interrupt is pending.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>DATERI</name>
       <description>Data NACK Error Interrupt.</description>
       <bitRange>[11:11]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>inactive</name>
         <description>No Interrupt is Pending.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>pending</name>
         <description>An interrupt is pending.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>DNRERI</name>
       <description>Do Not Respond Error Interrupt.</description>
       <bitRange>[12:12]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>inactive</name>
         <description>No Interrupt is Pending.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>pending</name>
         <description>An interrupt is pending.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>STRTERI</name>
       <description>Start Error Interrupt.</description>
       <bitRange>[13:13]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>inactive</name>
         <description>No Interrupt is Pending.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>pending</name>
         <description>An interrupt is pending.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>STOPERI</name>
       <description>Stop Error Interrupt.</description>
       <bitRange>[14:14]</bitRange>
       <enumeratedValues>
        <enumeratedValue>
         <name>inactive</name>
         <description>No Interrupt is Pending.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>pending</name>
         <description>An interrupt is pending.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TXLOI</name>
       <description>Transmit Lock Out Interrupt.</description>
       <bitRange>[15:15]</bitRange>
      </field>
      <field>
       <name>RDAMI</name>
       <description>Slave Read Address Match Interrupt.</description>
       <bitRange>[22:22]</bitRange>
      </field>
      <field>
       <name>WRAMI</name>
       <description>Slave Write Address Match Interrupt.</description>
       <bitRange>[23:23]</bitRange>
      </field>
     </fields>
    </register>
