analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32520/Include/max32520.svd
   </registers>
  </peripheral>
<!--PWRSEQ Power Sequencer / Low Power Control Register.-->
  <peripheral>
   <name>SFE</name>
   <description>Serial Flash Emulator.</description>
   <baseAddress>0x400A0000</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x1000</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>CFG</name>
     <description>SFE Configuration Register.</description>
     <addressOffset>0x0400</addressOffset>
     <size>32</size>
     <fields>
      <field>
       <name>DRLE</name>
       <description>Data Rise Launch Edge Enable.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>FLOCK</name>
       <description>Flash Lock.</description>
       <bitOffset>15</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RD_EN</name>
       <description>RAM Read Enable.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>WR_EN</name>
       <description>RAM Write Enable.</description>
       <bitOffset>17</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RRLOCK</name>
       <description>RAM Read Lock.</description>
       <bitOffset>22</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RWLOCK</name>
       <description>RAM Write Lock.</description>
       <bitOffset>23</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>HFSA</name>
     <description>SFE Host Flash Start Address Register.</description>
     <addressOffset>0x0408</addressOffset>
     <fields>
      <field>
       <name>HFSA</name>
       <description> Serial Flash Host Flash Start Address.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>22</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>HRSA</name>
     <description>SFE Host RAM Start Address Register.</description>
     <addressOffset>0x040C</addressOffset>
     <fields>
      <field>
       <name>HRSA</name>
       <description> Serial Flash Host RAM Start Address.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>22</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>SFDP_SBA</name>
     <description>SFE Discoverable Parameter System Base Register.</description>
     <addressOffset>0x0410</addressOffset>
     <fields>
      <field>
       <name>SFDP_SBA</name>
       <description> SFDP upper 24 bits System Base Address.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>24</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>FLASH_SBA</name>
     <description>Flash System Base Address Register.</description>
     <addressOffset>0x0414</addressOffset>
     <fields>
      <field>
       <name>FLASH_SBA</name>
       <description> FLASH upper 22 bits System Base Address.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>22</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>FLASH_STA</name>
     <description>Flash System Top Address Register.</description>
     <addressOffset>0x0418</addressOffset>
     <fields>
      <field>
       <name>FLASH_STA</name>
       <description> FLASH upper 22 bits System Top Address.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>22</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>RAM_SBA</name>
     <description>RAM System Base Address Register.</description>
     <addressOffset>0x041C</addressOffset>
     <fields>
      <field>
       <name>RAM_SBA</name>
       <description> RAM upper 22 bits System Base Address.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>22</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>RAM_STA</name>
     <description>RAM System Top Address Register.</description>
     <addressOffset>0x0420</addressOffset>
     <fields>
      <field>
       <name>RAM_STA</name>
       <description> RAM upper 22 bits System Top Address.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>22</bitWidth>
      </field>
     </fields>
    </register>
   </registers>
  </peripheral>
<!--SFE Serial Flash Emulator.-->
  <peripheral>
   <name>SIR</name>
   <description>System Initialization Registers.</description>
   <baseAddress>0x40000400</baseAddress>
   <access>read-only</access>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x400</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>SISTAT</name>
     <description>System Initialization Status Register.</description>
     <addressOffset>0x00</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>MAGIC</name>
       <description>Magic Word Validation.  This bit is set by the system initialization block following power-up.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <usage>read</usage>
        <enumeratedValue>
         <name>magicNotSet</name>
         <description>Magic word was not set (OTP has not been initialized properly).</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>magicSet</name>
         <description>Magic word was set (OTP contains valid settings).</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>CRCERR</name>
       <description>CRC Error Status.  This bit is set by the system initialization block following power-up.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <usage>read</usage>
        <enumeratedValue>
         <name>noError</name>
         <description>No CRC errors occurred during the read of the OTP memory block.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>error</name>
         <description>A CRC error occurred while reading the OTP. The address of the failure location in the OTP memory is stored in the ERRADDR register.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>ERRADDR</name>
     <description>Read-only field set by the SIB block if a CRC error occurs during the read of the OTP memory. Contains the failing address in OTP memory (when CRCERR equals 1).</description>
     <addressOffset>0x04</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>ERRADDR</name>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>FSTAT</name>
     <description>funcstat register.</description>
     <addressOffset>0x100</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>FPU</name>
       <description>FPU Function.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>no</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>yes</name>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>NMI</name>
       <description>NMI function.</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>no</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>yes</name>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SFES</name>
       <description>SFES function.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>no</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>yes</name>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>SFSTAT</name>
     <description>secfuncstat register.</description>
     <addressOffset>0x104</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>TRNG</name>
       <description>TRNG function.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>no</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>yes</name>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>AES</name>
       <description>AES function.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>no</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>yes</name>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SHA</name>
       <description>SHA function.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>no</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>yes</name>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
